---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MepPipeUpperObvertElevation
source: html/51c406c9-e961-d6c6-4eb8-850383279dbd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MepPipeUpperObvertElevation Property

"Upper End Obvert Elevation"

## Syntax (C#)
```csharp
public static ForgeTypeId MepPipeUpperObvertElevation { get; }
```